app/controllers/banners_controller.rb

  def index
    @banners = Banner.all
---
SELECT "banners".* FROM "banners"

    def set_banner
      @banner = Banner.find(params[:id])
---
SELECT  "banners".* FROM "banners" WHERE "banners"."id" = $1 LIMIT 1  [["id", 1]]