app/controllers/contact_infos_controller.rb

  def index
    @contact_infos = ContactInfo.all
---
SELECT "contact_infos".* FROM "contact_infos"

	def login
      @contact_info = ContactInfo.find_by_mobile_one(params[:mobile_one])
	  	debugger

	    respond_to do |format|
		  	if @contact_info.present?
---
SELECT  "contact_infos".* FROM "contact_infos" WHERE "contact_infos"."mobile_one" = $1 LIMIT 1  [["mobile_one", 8888888]]
SELECT "contact_infos".* FROM "contact_infos"

    def set_contact_info
      @contact_info = ContactInfo.find(params[:id])
---
SELECT  "contact_infos".* FROM "contact_infos" WHERE "contact_infos"."id" = $1 LIMIT 1  [["id", 1]]